Revit 2027 API
AnalysisResultSchema.GetNumberOfUnits Method
 returns number of possible units
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfUnits()
Public Function GetNumberOfUnits As Integer
public:
int GetNumberOfUnits()
member GetNumberOfUnits : unit -> int
Return Value
Int32
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace